Revit 2026 API

# DimensionAreSegmentsEqual Property

---

Indicates if all segments are forced to be equal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AreSegmentsEqual { get; set; }
```
```vb
Public Property AreSegmentsEqual As Boolean
	Get
	Set
```
```cpp
public:
property bool AreSegmentsEqual {
	bool get ();
	void set (bool value);
}
```
```fsharp
member AreSegmentsEqual : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the dimension is non-linear or has only one segment. |

This property is usable only for linear dimensions with more than one segment.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace